# importing all the required libraries

In [3]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

In [4]:
df=pd.read_csv("Titanic.csv") #Loading/Importing the CSV file dataset

# Dataset OverView

In [5]:
df.head() #shows first 5 rows of the dataset

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Data Exploration

In [6]:
df.shape #it shows the number of rows and columns

(891, 12)

In [7]:
df.info() #gives the overview of column information

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [8]:
df.describe() #describes the aggregates of the dataset

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

# Data Cleaing Process

In [9]:
df.isnull().sum() #The number of null values in the each column

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [10]:
df.drop("Cabin",axis=1,inplace=True) #Dropping/Deleting the entire Cabin column bcz of lot of missing/null values

In [11]:
df.isnull().sum() #checking whether the Cabin column is dropped or not

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [12]:
df['Age'].skew() #Checking the skewness of the asymmetry data distribution & it shows that we have normal distribution of data

0.38910778230082704

In [13]:
df['Age']=df['Age'].fillna(df['Age'].mean) #Handling the missing values in the Age columns with mean

In [14]:
df.isna().sum() #Checking that the Age columns missing values are replaced or not

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

In [15]:
df['Embarked']=df['Embarked'].fillna(df['Embarked'].mode()[0]) # Handling the missing values in the Embarked column with mode

In [16]:
df.isna().sum() #Checking whether we are still left with null values

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

# Handling Duplicates

In [17]:
df.duplicated().sum() #Sum of duplicate values

0

# Key Insights/Data Analysis Process

In [18]:
df["PassengerId"].count() #Number of Passangers present on the ship

891

In [19]:
df['Survived'].value_counts() #Count of Number of peoples Survived & not Survived

Survived
0    549
1    342
Name: count, dtype: int64

In [20]:
df.groupby("Sex")["Survived"].count() #Counting the number of Male & Female passangers on the ship that survived

Sex
female    314
male      577
Name: Survived, dtype: int64

In [21]:
df.groupby('Sex')['Survived'].mean()*100 #The percentage of Genders that inlcude both, the survived & non survived one's

Sex
female    74.203822
male      18.890815
Name: Survived, dtype: float64